code_sweepdelay/stress-output_75ms_at20.log
******************** Stress Settings ********************
Command:
  Type: write
  Count: -1
  Duration: 90 SECONDS
  No Warmup: false
  Consistency Level: ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Sequence: 1..1000000
  Order: ARBITRARY
  Wrap: true
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 1
  Column Names: [C0]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=1
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V4
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [cassandra_a, cassandra_b, cassandra_c]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Pptions: {replication_factor=3}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  Thrift Port: 9160
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: WRITE
TokenRange:
  Wrap: false
  Split Factor: 1

Connected to cluster: TestCluster, max pending requests per connection 128, max connections per host 8
Datatacenter: datacenter1; Host: cassandra_a/172.28.0.2; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_b/172.28.0.3; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_c/172.28.0.4; Rack: rack1
Created keyspaces. Sleeping 3s for propagation.
Sleeping 2s...
Warming up WRITE with 150000 iterations...
Failed to connect over JMX; not collecting these stats
Running WRITE with 50 threads 90 seconds
Failed to connect over JMX; not collecting these stats
type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
total,         40338,   40338,   40338,   40338,     0.5,     0.5,     1.1,     1.8,     5.2,    18.5,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,        124169,   83831,   83831,   83831,     0.6,     0.4,     1.0,     1.7,    37.4,    88.8,    2.0,  0.27043,      0,      0,       0,       0,       0,       0
total,        214867,   90698,   90698,   90698,     0.5,     0.4,     1.1,     1.8,    21.6,    32.0,    3.0,  0.18638,      0,      0,       0,       0,       0,       0
total,        306128,   91261,   91261,   91261,     0.5,     0.4,     1.0,     1.5,    49.0,    65.3,    4.0,  0.14296,      0,      0,       0,       0,       0,       0
total,        392628,   86500,   86500,   86500,     0.6,     0.4,     1.1,     1.8,    12.8,    79.2,    5.0,  0.11420,      0,      0,       0,       0,       0,       0
total,        487478,   94850,   94850,   94850,     0.5,     0.4,     1.0,     1.7,     3.7,    12.7,    6.0,  0.09545,      0,      0,       0,       0,       0,       0
total,        566476,   78998,   78998,   78998,     0.6,     0.4,     1.1,     1.9,    62.9,   130.7,    7.0,  0.08150,      0,      0,       0,       0,       0,       0
total,        657275,   90799,   90799,   90799,     0.5,     0.4,     1.0,     1.5,    16.5,    75.3,    8.0,  0.07183,      0,      0,       0,       0,       0,       0
total,        740508,   83233,   83233,   83233,     0.6,     0.4,     1.0,     1.6,     6.3,   151.9,    9.0,  0.06417,      0,      0,       0,       0,       0,       0
total,        830186,   89678,   89678,   89678,     0.6,     0.4,     1.0,     1.7,    52.9,    83.2,   10.0,  0.05793,      0,      0,       0,       0,       0,       0
total,        932132,  101946,  101946,  101946,     0.5,     0.4,     1.0,     1.6,     3.8,    10.2,   11.0,  0.05344,      0,      0,       0,       0,       0,       0
total,       1006880,   74748,   74748,   74748,     0.7,     0.4,     1.1,     1.8,    94.5,   133.4,   12.0,  0.04939,      0,      0,       0,       0,       0,       0
total,       1008940,    2060,    2060,    2060,    24.1,     0.5,    75.5,   150.5,   151.3,   151.3,   13.0,  0.09205,      0,      0,       0,       0,       0,       0
total,       1009910,     970,     970,     970,    50.5,    75.3,    75.4,    75.5,    75.6,    75.6,   14.0,  0.11749,      0,      0,       0,       0,       0,       0
total,       1010914,    1004,    1004,    1004,    48.9,    75.3,    75.4,    75.5,    75.6,    75.6,   15.0,  0.13564,      0,      0,       0,       0,       0,       0
total,       1011892,     978,     978,     978,    50.1,    75.3,    75.4,    75.5,    75.6,    75.6,   16.0,  0.14967,      0,      0,       0,       0,       0,       0
total,       1012972,    1080,    1080,    1080,    48.8,    75.3,    75.4,    75.5,    75.6,    75.7,   17.0,  0.16093,      0,      0,       0,       0,       0,       0
total,       1013951,     979,     979,     979,    50.1,    75.3,    75.4,    75.4,    75.6,    75.6,   18.0,  0.17031,      0,      0,       0,       0,       0,       0
total,       1014957,    1006,    1006,    1006,    48.8,    75.3,    75.4,    75.4,    75.5,    75.6,   19.0,  0.17822,      0,      0,       0,       0,       0,       0
total,       1015952,     995,     995,     995,    49.3,    75.3,    75.4,    75.4,    75.6,    75.6,   20.0,  0.18501,      0,      0,       0,       0,       0,       0
total,       1017019,    1067,    1067,    1067,    49.4,    75.3,    75.4,    75.4,    75.4,    75.4,   21.0,  0.19088,      0,      0,       0,       0,       0,       0
total,       1018018,     999,     999,     999,    49.1,    75.3,    75.4,    75.4,    75.5,    75.5,   22.0,  0.19605,      0,      0,       0,       0,       0,       0
total,       1018981,     963,     963,     963,    51.0,    75.3,    75.4,    75.4,    75.5,    75.5,   23.0,  0.20063,      0,      0,       0,       0,       0,       0
total,       1019988,    1007,    1007,    1007,    48.7,    75.3,    75.4,    75.5,    75.6,    75.6,   24.0,  0.20470,      0,      0,       0,       0,       0,       0
total,       1021026,    1038,    1038,    1038,    50.8,    75.3,    75.4,    75.7,    75.9,    75.9,   25.0,  0.20832,      0,      0,       0,       0,       0,       0
total,       1022016,     990,     990,     990,    49.5,    75.3,    75.4,    75.4,    75.5,    75.5,   26.0,  0.21160,      0,      0,       0,       0,       0,       0
total,       1022998,     982,     982,     982,    50.0,    75.3,    75.4,    75.4,    75.5,    75.5,   27.0,  0.21457,      0,      0,       0,       0,       0,       0
total,       1024006,    1008,    1008,    1008,    48.6,    75.3,    75.4,    75.4,    75.5,    75.5,   28.0,  0.21726,      0,      0,       0,       0,       0,       0
total,       1025111,    1105,    1105,    1105,    47.7,    75.3,    75.4,    75.4,    75.5,    75.5,   29.0,  0.21967,      0,      0,       0,       0,       0,       0
total,       1026125,    1014,    1014,    1014,    48.4,    75.3,    75.4,    75.4,    75.5,    75.6,   30.0,  0.22191,      0,      0,       0,       0,       0,       0
total,       1027079,     954,     954,     954,    51.5,    75.3,    75.4,    75.4,    75.5,    75.5,   31.0,  0.22398,      0,      0,       0,       0,       0,       0
total,       1028065,     986,     986,     986,    50.2,    75.3,    75.4,    75.4,    75.5,    75.6,   32.0,  0.22587,      0,      0,       0,       0,       0,       0
total,       1029126,    1061,    1061,    1061,    49.3,    75.3,    75.4,    75.4,    75.6,    75.6,   33.0,  0.22759,      0,      0,       0,       0,       0,       0
total,       1030165,    1039,    1039,    1039,    47.2,    75.3,    75.4,    75.4,    75.5,    75.6,   34.0,  0.22918,      0,      0,       0,       0,       0,       0
total,       1031088,     923,     923,     923,    52.8,    75.3,    75.6,   137.8,   139.7,   141.4,   35.0,  0.23066,      0,      0,       0,       0,       0,       0
total,       1032138,    1050,    1050,    1050,    49.6,    75.3,    75.4,    75.5,    75.6,    75.6,   36.0,  0.23202,      0,      0,       0,       0,       0,       0
total,       1033122,     984,     984,     984,    50.5,    75.3,    75.4,    75.5,    75.7,    82.6,   37.0,  0.23330,      0,      0,       0,       0,       0,       0
total,       1034107,     985,     985,     985,    49.8,    75.3,    75.4,    75.4,    75.4,    75.6,   38.0,  0.23449,      0,      0,       0,       0,       0,       0
total,       1035072,     965,     965,     965,    50.8,    75.3,    75.4,    75.4,    75.6,    75.6,   39.0,  0.23560,      0,      0,       0,       0,       0,       0
total,       1036096,    1024,    1024,    1024,    51.4,    75.3,    75.4,    75.4,    75.7,    76.9,   40.0,  0.23662,      0,      0,       0,       0,       0,       0
total,       1037076,     980,     980,     980,    50.2,    75.3,    75.4,    75.4,    75.5,    75.6,   41.0,  0.23759,      0,      0,       0,       0,       0,       0
total,       1038038,     962,     962,     962,    50.9,    75.3,    75.4,    75.4,    75.4,    75.4,   42.0,  0.23850,      0,      0,       0,       0,       0,       0
total,       1039028,     990,     990,     990,    49.6,    75.2,    75.4,    75.4,    75.4,    75.4,   43.0,  0.23934,      0,      0,       0,       0,       0,       0
total,       1040095,    1067,    1067,    1067,    49.3,    75.2,    75.4,    75.4,    75.4,    75.8,   44.0,  0.24010,      0,      0,       0,       0,       0,       0
total,       1041077,     982,     982,     982,    50.0,    75.2,    75.4,    75.4,    75.4,    75.4,   45.0,  0.24083,      0,      0,       0,       0,       0,       0
total,       1042052,     975,     975,     975,    50.3,    75.2,    75.4,    75.4,    75.4,    75.5,   46.0,  0.24152,      0,      0,       0,       0,       0,       0
total,       1043048,     996,     996,     996,    50.8,    75.3,    75.4,    75.4,    75.4,    75.5,   47.0,  0.24217,      0,      0,       0,       0,       0,       0
total,       1044104,    1056,    1056,    1056,    48.5,    75.3,    75.4,    75.4,    75.5,    75.5,   48.0,  0.24275,      0,      0,       0,       0,       0,       0
total,       1045086,     982,     982,     982,    49.9,    75.3,    75.4,    75.4,    75.4,    75.4,   49.0,  0.24332,      0,      0,       0,       0,       0,       0
total,       1046025,     939,     939,     939,    52.2,    75.3,    75.4,    75.4,    75.6,    75.6,   50.0,  0.24386,      0,      0,       0,       0,       0,       0
total,       1047032,    1007,    1007,    1007,    51.0,    75.2,    75.4,    75.4,    75.4,    75.4,   51.0,  0.24436,      0,      0,       0,       0,       0,       0
total,       1048044,    1012,    1012,    1012,    49.8,    75.3,    75.4,    75.4,    75.6,    75.6,   52.0,  0.24482,      0,      0,       0,       0,       0,       0
total,       1048990,     946,     946,     946,    51.8,    75.3,    75.4,    75.4,    75.4,    75.5,   53.0,  0.24527,      0,      0,       0,       0,       0,       0
total,       1049952,     962,     962,     962,    50.9,    75.3,    75.4,    75.4,    78.4,    79.9,   54.0,  0.24568,      0,      0,       0,       0,       0,       0
total,       1050972,    1020,    1020,    1020,    50.8,    75.3,    75.4,    75.4,    75.4,    75.4,   55.0,  0.24606,      0,      0,       0,       0,       0,       0
total,       1051949,     977,     977,     977,    51.2,    75.3,    75.4,    75.4,    79.0,    79.4,   56.0,  0.24642,      0,      0,       0,       0,       0,       0
total,       1052947,     998,     998,     998,    49.1,    75.3,    75.4,    75.4,    75.5,    75.5,   57.0,  0.24676,      0,      0,       0,       0,       0,       0
total,       1053973,    1026,    1026,    1026,    47.8,    75.3,    75.4,    75.4,    75.4,    75.4,   58.0,  0.24706,      0,      0,       0,       0,       0,       0
total,       1055013,    1040,    1040,    1040,    50.2,    75.3,    75.4,    75.4,    75.5,    75.5,   59.0,  0.24734,      0,      0,       0,       0,       0,       0
total,       1056051,    1038,    1038,    1038,    47.7,    75.3,    75.4,    75.4,    75.5,    75.8,   60.0,  0.24761,      0,      0,       0,       0,       0,       0
total,       1057004,     953,     953,     953,    51.4,    75.3,    75.4,    75.4,    75.4,    75.4,   61.0,  0.24788,      0,      0,       0,       0,       0,       0
total,       1057981,     977,     977,     977,    50.2,    75.3,    75.4,    75.4,    75.5,    75.7,   62.0,  0.24812,      0,      0,       0,       0,       0,       0
total,       1059052,    1071,    1071,    1071,    49.1,    75.3,    75.4,    75.4,    75.4,    75.5,   63.0,  0.24832,      0,      0,       0,       0,       0,       0
total,       1060028,     976,     976,     976,    50.4,    75.3,    75.4,    75.4,    75.5,    75.5,   64.0,  0.24854,      0,      0,       0,       0,       0,       0
total,       1060996,     968,     968,     968,    50.6,    75.3,    75.4,    75.5,    75.6,    75.6,   65.0,  0.24874,      0,      0,       0,       0,       0,       0
total,       1061940,     944,     944,     944,    52.2,    75.3,    75.4,    75.4,    75.5,    75.6,   66.0,  0.24893,      0,      0,       0,       0,       0,       0
total,       1062987,    1047,    1047,    1047,    50.1,    75.3,    75.4,    75.4,    75.5,    75.8,   67.0,  0.24908,      0,      0,       0,       0,       0,       0
total,       1063979,     992,     992,     992,    49.5,    75.3,    75.4,    75.4,    75.4,    75.4,   68.0,  0.24924,      0,      0,       0,       0,       0,       0
total,       1064908,     929,     929,     929,    52.7,    75.3,    75.4,    75.4,    75.5,    75.5,   69.0,  0.24940,      0,      0,       0,       0,       0,       0
total,       1065938,    1030,    1030,    1030,    49.1,    75.3,    75.4,    75.4,    75.5,    75.5,   70.0,  0.24952,      0,      0,       0,       0,       0,       0
total,       1066958,    1020,    1020,    1020,    50.2,    75.3,    75.4,    75.4,    75.5,    75.5,   71.0,  0.24963,      0,      0,       0,       0,       0,       0
total,       1067917,     959,     959,     959,    51.2,    75.2,    75.4,    75.4,    75.4,    75.4,   72.0,  0.24975,      0,      0,       0,       0,       0,       0
total,       1068877,     960,     960,     960,    51.0,    75.2,    75.4,    75.4,    75.4,    75.5,   73.0,  0.24986,      0,      0,       0,       0,       0,       0
total,       1069893,    1016,    1016,    1016,    51.0,    75.2,    75.4,    75.4,    75.4,    75.5,   74.0,  0.24994,      0,      0,       0,       0,       0,       0
total,       1070888,     995,     995,     995,    50.2,    75.3,    75.4,    75.4,    75.5,    75.5,   75.0,  0.25002,      0,      0,       0,       0,       0,       0
total,       1071855,     967,     967,     967,    50.8,    75.3,    75.4,    75.4,    75.6,    75.6,   76.0,  0.25010,      0,      0,       0,       0,       0,       0
total,       1072804,     949,     949,     949,    51.6,    75.3,    75.4,    75.4,    75.4,    75.5,   77.0,  0.25017,      0,      0,       0,       0,       0,       0
total,       1073891,    1087,    1087,    1087,    48.1,    75.2,    75.4,    75.4,    75.4,    75.5,   78.0,  0.25020,      0,      0,       0,       0,       0,       0
total,       1074874,     983,     983,     983,    50.3,    75.3,    75.4,    75.4,    75.4,    75.4,   79.0,  0.25025,      0,      0,       0,       0,       0,       0
total,       1075838,     964,     964,     964,    50.8,    75.3,    75.4,    75.4,    75.5,    75.5,   80.0,  0.25030,      0,      0,       0,       0,       0,       0
total,       1076810,     972,     972,     972,    50.4,    75.3,    75.4,    75.4,    75.4,    75.5,   81.0,  0.25034,      0,      0,       0,       0,       0,       0
total,       1077920,    1110,    1110,    1110,    47.3,    75.2,    75.4,    75.4,    75.4,    75.4,   82.0,  0.25033,      0,      0,       0,       0,       0,       0
total,       1078914,     994,     994,     994,    49.6,    75.2,    75.4,    75.4,    75.5,    75.5,   83.0,  0.25035,      0,      0,       0,       0,       0,       0
total,       1079891,     977,     977,     977,    50.2,    75.3,    75.4,    75.4,    75.5,    75.8,   84.0,  0.25037,      0,      0,       0,       0,       0,       0
total,       1080866,     975,     975,     975,    50.3,    75.2,    75.4,    75.4,    75.4,    75.8,   85.0,  0.25038,      0,      0,       0,       0,       0,       0
total,       1081948,    1082,    1082,    1082,    48.6,    75.2,    75.4,    75.4,    75.4,    75.4,   86.0,  0.25036,      0,      0,       0,       0,       0,       0
total,       1082921,     973,     973,     973,    50.5,    75.2,    75.4,    75.4,    75.4,    75.5,   87.0,  0.25036,      0,      0,       0,       0,       0,       0
total,       1083884,     963,     963,     963,    50.9,    75.2,    75.4,    75.4,    75.5,    75.5,   88.0,  0.25036,      0,      0,       0,       0,       0,       0
total,       1084914,    1030,    1030,    1030,    49.1,    75.2,    75.4,    75.4,    75.4,    75.4,   89.0,  0.25034,      0,      0,       0,       0,       0,       0
total,       1085903,     989,     989,     989,    51.7,    75.2,    75.4,    75.4,    75.4,    75.5,   90.0,  0.25032,      0,      0,       0,       0,       0,       0
total,       1086486,     951,     951,     951,    51.8,    75.3,    75.4,    75.5,    76.0,    76.0,   90.6,  0.25030,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :   11,990 op/s  [WRITE: 11,990 op/s]
Partition rate            :   11,990 pk/s  [WRITE: 11,990 pk/s]
Row rate                  :   11,990 row/s [WRITE: 11,990 row/s]
Latency mean              :    4.1 ms [WRITE: 4.1 ms]
Latency median            :    0.4 ms [WRITE: 0.4 ms]
Latency 95th percentile   :    3.1 ms [WRITE: 3.1 ms]
Latency 99th percentile   :   75.4 ms [WRITE: 75.4 ms]
Latency 99.9th percentile :   75.4 ms [WRITE: 75.4 ms]
Latency max               :  151.9 ms [WRITE: 151.9 ms]
Total partitions          :  1,086,486 [WRITE: 1,086,486]
Total errors              :          0 [WRITE: 0]
Total GC count            : 0
Total GC memory           : 0.000 KiB
Total GC time             :    0.0 seconds
Avg GC time               :    NaN ms
StdDev GC time            :    0.0 ms
Total operation time      : 00:01:30

END